; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 368195 1 2 4 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared3 - mode
	thermograph1 - mode
	image2 - mode
	infrared0 - mode
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star0 - direction
	Planet4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
)
(:goal (and
	(pointing satellite0 Star2)
	(have_image Planet4 infrared0)
	(have_image Star5 infrared0)
	(have_image Planet6 infrared0)
	(have_image Star7 image2)
	(have_image Star8 infrared3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
3. (turn_to satellite0 star0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
4. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
5. (turn_to satellite0 star8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
6. (take_image satellite0 star8 instrument0 infrared3)
   added: (have_image star8 infrared3)
   goals met: 1 of 6
7. (turn_to satellite0 star7 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star7)
   goals met: 1 of 6
8. (take_image satellite0 star7 instrument0 image2)
   added: (have_image star7 image2)
   goals met: 2 of 6
9. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
10. (take_image satellite0 star5 instrument0 infrared0)
   added: (have_image star5 infrared0)
   goals met: 3 of 6
11. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   goals met: 4 of 6
12. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   goals met: 3 of 6
13. (take_image satellite0 planet6 instrument0 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 4 of 6
14. (turn_to satellite0 star2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star2)
   goals met: 5 of 6
15. (turn_to satellite0 planet4 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet4)
   goals met: 4 of 6
16. (take_image satellite0 planet4 instrument0 infrared0)
   added: (have_image planet4 infrared0)
   goals met: 5 of 6
17. (turn_to satellite0 star2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 star2)
   goals met: 6 of 6
